# frozen_string_literal: true

### tap
tap 'homebrew/bundle' # brew bundle コマンド
tap 'homebrew/services' # brew service コマンド
tap 'homebrew/cask-fonts' # フォント
tap 'homebrew/cask-versions' # 異なるバージョンの cask

### Casks
cask 'mactex-no-gui' # LaTeX環境のGUIなし
cask 'drawio' # 図を作る時のやつ
cask 'google-drive' # お絵描きフォルダとかの設定用のドライブ
cask 'utm' # Ubuntuとかの仮装マシン
cask 'raycast' # Warpとかのショートカットキーを設定
cask 'warp' # 普段使ってるターミナル
cask 'rubymine' # Ruby on Rails用のIDE
cask 'hammerspoon' # MacOSをluaスクリプトで自動化
cask 'discord' # チャットツール
cask 'arc' # 愛用ブラウザ
cask 'google-chrome' # フレームワークによってはなんだかんだあったほうがいいブラウザ
cask 'cursor' # AI IDE
cask 'appcleaner' # アプリ消す用
cask 'onedrive' # 言わずもがなクラウドファイルのonedrive
cask 'docker-desktop' # docker

### Homebrew
brew 'mas' # Mac App Store command-line interface
brew 'git' # CLIでgitを実行するよう
brew 'tree' # ディレクトリ構造見るコマンド
brew 'inetutils' # ftp,ping,ifconfig等
brew 'mise' # 言語のバージョン管理ツール
brew 'marp-cli' # Markdownでのスライド作成
brew 'jq' # grepみたいにパイプで指定するとjsonを整形してくれる
