# frozen_string_literal: true

### tap
tap 'homebrew/bundle' # brew bundle コマンド
tap 'homebrew/services' # brew service コマンド
tap 'homebrew/cask-fonts' # フォント
tap 'homebrew/cask-versions' # 異なるバージョンの cask

### Homebrew
brew 'mactex-no-gui' # LaTeX環境のGUIなし
brew 'drawio' # 図を作る時のやつ
brew 'utm' # Ubuntuとかの仮装マシン
brew 'raycast' # Warpとかのショートカットキーを設定
brew 'warp' # 普段使ってるターミナル
brew 'discord' # チャットツール
brew 'arc' # 愛用ブラウザ
brew 'cursor' # AI IDE
brew 'cmux' # メニューバーからターミナルを呼び出すやつ
brew 'orbstack' # Docker Desktopより軽いコンテナ/VM環境
brew 'appcleaner' # アプリ消す用
brew 'notunes' # MacbookでBluetoothイヤホン接続したりするときにitunesが勝手に起動するのがうざすぎて入れたやつ

brew 'mas' # Mac App Store command-line interface
brew 'awscli' # AWS の公式CLI
brew 'cloudflared' # Cloudflare Tunnel/Zero Trust 用CLI
brew 'git' # CLIでgitを実行するよう
brew 'tree' # ディレクトリ構造見るコマンド
brew 'inetutils' # ftp,ping,ifconfig等
brew 'mise' # 言語のバージョン管理ツール
brew 'marp-cli' # Markdownでのスライド作成
brew 'jq' # grepみたいにパイプで指定するとjsonを整形してくれる
brew 'ghq' # リポジトリ管理できるやつ
brew 'peco' # リポジトリ管理の関数動かすのに必要
brew 'zsh-autosuggestions' # zsh のコマンド補完支援
