### tap
tap "homebrew/bundle" # brew bundle コマンド
tap "homebrew/cask" # GUI アプリのインストール
tap "homebrew/services" # brew service コマンド
tap "homebrew/cask-fonts" # フォント
tap "homebrew/cask-versions" # 異なるバージョンの cask
### Casks
cask "visual-studio-code" # 多機能テキストエディタ
cask "mactex-no-gui"# TeX Live (GUI アプリなし)
cask "drawio" # Applicaiton for Diagrams.net
cask "google-drive"
cask "sourcetree"
cask "utm"
cask "google-chrome"
cask "raycast"
cask "rubymine"

### Homebrew
brew "mas" # Mac App Store command-line interface
brew "python" # Python 言語
brew "python-tk" # Python interface to Tcl/Tkcask
brew "rbenv"
brew "ruby-build"
brew "sqlite3"
brew "git"
brew "tree"
brew "yarn"
brew "mariadb"
brew "inetutils"
brew "rbenv"
brew "ruby-build"
### mas
